teledoge618/DAP_GD32F407/source/cmsis_dap/dap_port.c
#include "dap_port.h"

#include "gd32f4xx.h"
#include "gd32f4xx_libopt.h"
#include "ulog.h"

/* SWD和JTAG的相关配置信息，定义在dap.c */
extern dap_data_t dap_data;

static uint32_t swj_timer0_cnt = 0xFFFFFFFF;
static volatile uint8_t spi_rdata_buf[4] = {0};

// clang-format off

/* 奇偶校验快速计算表 */
static const uint8_t parity_mapping_table[256] = {
    0, 1, 1, 0, 1, 0, 0, 1, 1, 0, 0, 1, 0, 1, 1, 0, 
    1, 0, 0, 1, 0, 1, 1, 0, 0, 1, 1, 0, 1, 0, 0, 1, 
    1, 0, 0, 1, 0, 1, 1, 0, 0, 1, 1, 0, 1, 0, 0, 1, 
    0, 1, 1, 0, 1, 0, 0, 1, 1, 0, 0, 1, 0, 1, 1, 0, 
    1, 0, 0, 1, 0, 1, 1, 0, 0, 1, 1, 0, 1, 0, 0, 1, 
    0, 1, 1, 0, 1, 0, 0, 1, 1, 0, 0, 1, 0, 1, 1, 0, 
    0, 1, 1, 0, 1, 0, 0, 1, 1, 0, 0, 1, 0, 1, 1, 0, 
    1, 0, 0, 1, 0, 1, 1, 0, 0, 1, 1, 0, 1, 0, 0, 1, 
    1, 0, 0, 1, 0, 1, 1, 0, 0, 1, 1, 0, 1, 0, 0, 1, 
    0, 1, 1, 0, 1, 0, 0, 1, 1, 0, 0, 1, 0, 1, 1, 0, 
    0, 1, 1, 0, 1, 0, 0, 1, 1, 0, 0, 1, 0, 1, 1, 0, 
    1, 0, 0, 1, 0, 1, 1, 0, 0, 1, 1, 0, 1, 0, 0, 1, 
    0, 1, 1, 0, 1, 0, 0, 1, 1, 0, 0, 1, 0, 1, 1, 0, 
    1, 0, 0, 1, 0, 1, 1, 0, 0, 1, 1, 0, 1, 0, 0, 1, 
    1, 0, 0, 1, 0, 1, 1, 0, 0, 1, 1, 0, 1, 0, 0, 1, 
    0, 1, 1, 0, 1, 0, 0, 1, 1, 0, 0, 1, 0, 1, 1, 0};

// clang-format on

/* 位带地址计算公式 */
#define BIT_BAND_PERIPH(reg_addr, nbit) (*((volatile uint8_t *)(uint32_t)(0x42000000 + ((reg_addr) - 0x40000000) * 32U + nbit * 4U)))
#define BIT_BAND_RAM(ram_addr, nbit) (*((volatile uint8_t *)(uint32_t)(0x22000000 + ((ram_addr) - 0x20000000) * 32U + nbit * 4U)))

/* T0 */
#define T0_ENABLE() (BIT_BAND_PERIPH((TIMER0 + 0x00), 0) = 0x01)
#define T0_DISABLE() (BIT_BAND_PERIPH((TIMER0 + 0x00), 0) = 0x00)
#define T0_IS_ENABLE() BIT_BAND_PERIPH((TIMER0 + 0x00), 0)
#define T0_SOFT_UPDATE() (BIT_BAND_PERIPH((TIMER0 + 0x14U), 0) = 0x01)
#define T0_UP_FLAG_CLEAR() (BIT_BAND_PERIPH((TIMER0 + 0x10U), 0) = 0x00)

/* T3 */
#define T3_ENABLE() (BIT_BAND_PERIPH((TIMER3 + 0x00), 0) = 0x01)
#define T3_DISABLE() (BIT_BAND_PERIPH((TIMER3 + 0x00), 0) = 0x00)

/* SPI0 */
#define SPI0_ENABLE() (BIT_BAND_PERIPH((SPI0 + 0x00), 6) = 0x01)
#define SPI0_DISABLE() (BIT_BAND_PERIPH((SPI0 + 0x00), 6) = 0x00)
#define SPI0_INT_RBNE_ENABLE() (BIT_BAND_PERIPH((SPI0 + 0x04), 6) = 0x01)
#define SPI0_INT_RBNE_DISABLE() (BIT_BAND_PERIPH((SPI0 + 0x04), 6) = 0x00)
#define SPI0_RBNE() BIT_BAND_PERIPH((SPI0 + 0x08), 0)

/* SPI0 DMA */
#define SPI0_DMA_TX_ENABLE() (BIT_BAND_PERIPH((SPI0 + 0x04), 1) = 0x01)
#define SPI0_DMA_TX_DISABLE() (BIT_BAND_PERIPH((SPI0 + 0x04), 1) = 0x00)
#define SPI0_DMA_RX_ENABLE() (BIT_BAND_PERIPH((SPI0 + 0x04), 0) = 0x01)
#define SPI0_DMA_RX_DISABLE() (BIT_BAND_PERIPH((SPI0 + 0x04), 0) = 0x00)

/* SPI2 */
#define SPI2_ENABLE() (BIT_BAND_PERIPH((SPI2 + 0x00), 6) = 0x01)
#define SPI2_DISABLE() (BIT_BAND_PERIPH((SPI2 + 0x00), 6) = 0x00)
#define SPI2_INT_RBNE_ENABLE() (BIT_BAND_PERIPH((SPI2 + 0x04), 6) = 0x01)
#define SPI2_INT_RBNE_DISABLE() (BIT_BAND_PERIPH((SPI2 + 0x04), 6) = 0x00)

/* SPI2 DMA */
#define SPI2_DMA_TX_ENABLE() (BIT_BAND_PERIPH((SPI2 + 0x04), 1) = 0x01)
#define SPI2_DMA_TX_DISABLE() (BIT_BAND_PERIPH((SPI2 + 0x04), 1) = 0x00)
#define SPI2_DMA_RX_ENABLE() (BIT_BAND_PERIPH((SPI2 + 0x04), 0) = 0x01)
#define SPI2_DMA_RX_DISABLE() (BIT_BAND_PERIPH((SPI2 + 0x04), 0) = 0x00)

/* DMA */
#define DMA1_CH5_ENABLE() (BIT_BAND_PERIPH((((DMA1) + 0x10U) + 0x18U * (DMA_CH5)), 0) = 0x01)
#define DMA1_CH5_DISABLE() (BIT_BAND_PERIPH((((DMA1) + 0x10U) + 0x18U * (DMA_CH5)), 0) = 0x00)
#define DMA1_CH5_IS_ENABLE() BIT_BAND_PERIPH((((DMA1) + 0x10U) + 0x18U * (DMA_CH5)), 0)
#define DMA1_CH0_ENABLE() (BIT_BAND_PERIPH((((DMA1) + 0x10U) + 0x18U * (DMA_CH0)), 0) = 0x01)
#define DMA1_CH0_DISABLE() (BIT_BAND_PERIPH((((DMA1) + 0x10U) + 0x18U * (DMA_CH0)), 0) = 0x00)
#define DMA1_CH0_IS_ENABLE() BIT_BAND_PERIPH((((DMA1) + 0x10U) + 0x18U * (DMA_CH0)), 0)

/* GPIO */
#define TMS_OEN_SET() (BIT_BAND_PERIPH(((GPIOD) + 0x18U), 12) = 0x01)
#define TMS_OEN_RESET() (BIT_BAND_PERIPH(((GPIOD) + 0x18U), 12 + 16) = 0x01) /* 高位清零 */
#define TMS_OEN_DO() (BIT_BAND_PERIPH(((GPIOD) + 0x14U), 12))
#define TMS_CTL_SET() (BIT_BAND_PERIPH(((GPIOA) + 0x18U), 6) = 0x01)
#define TMS_CTL_RESET() (BIT_BAND_PERIPH(((GPIOA) + 0x18U), 6 + 16) = 0x01) /* 高位清零 */
#define TMS_CTL_DO() (BIT_BAND_PERIPH(((GPIOA) + 0x14U), 6))

/* T5 */
#define T5_ENABLE() (BIT_BAND_PERIPH((TIMER5 + 0x00), 0) = 0x01)
#define T5_IS_ENABLE() BIT_BAND_PERIPH((TIMER5 + 0x00), 0)
#define T5_DISABLE() (BIT_BAND_PERIPH((TIMER5 + 0x00), 0) = 0x00)
#define T5_SOFT_UPDATE() (BIT_BAND_PERIPH((TIMER5 + 0x14U), 0) = 0x01)
#define T5_UP_FLAG_CLEAR() (BIT_BAND_PERIPH((TIMER5 + 0x10U), 0) = 0x00)

/**
 * @brief 小于1字节的TCK周期
 *
 * @param n_cycle 小于8
 */
__STATIC_INLINE void tck_cycle_n(uint16_t n_cycle) {
    if (n_cycle >= 8) {
        timer_channel_output_pulse_value_config(TIMER3, TIMER_CH_1, 0xFFFF);
    } else {
        uint16_t cnt = swj_timer0_cnt * n_cycle + swj_timer0_cnt / 4;
        timer_channel_output_pulse_value_config(TIMER3, TIMER_CH_1, cnt);
    }
    timer_repetition_value_config(TIMER0, 8 - 1);
    T0_SOFT_UPDATE();
    // T0_UP_FLAG_CLEAR();

    __set_BASEPRI(0x04); /* 屏蔽其他中断 */
    T3_ENABLE();
    T0_ENABLE();
    while (T0_IS_ENABLE()) {
    }

    T3_DISABLE();
    __set_BASEPRI(0x00);
    // T0_UP_FLAG_CLEAR();
}

/**
 * @brief 8倍数TCK周期
 *
 * @param n_byte
 */
__STATIC_INLINE void tck_cycle_byte(uint16_t n_byte) {
    timer_channel_output_pulse_value_config(TIMER3, TIMER_CH_1, 0xFFFF);
    timer_repetition_value_config(TIMER0, (8 * n_byte) - 1);
    T0_SOFT_UPDATE();
    // T0_UP_FLAG_CLEAR();

    __set_BASEPRI(0x04); /* 屏蔽其他中断 */
    T3_ENABLE();
    T0_ENABLE();
    while (T0_IS_ENABLE()) {
    }

    T3_DISABLE();
    __set_BASEPRI(0x00);
    // T0_UP_FLAG_CLEAR();
}

/* TMS传输方向控制 */
static void TmsOen(bool bit_enable) {
#if 1
    TMS_OEN_DO() = bit_enable;
#else
    if (bit_enable) {
        gpio_bit_set(GPIOD, GPIO_PIN_12);
        /* TMS_CTL */
        gpio_af_set(GPIOA, GPIO_AF_5, GPIO_PIN_6);
        gpio_mode_set(GPIOA, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_6);
    } else {
        gpio_bit_reset(GPIOD, GPIO_PIN_12);

        gpio_mode_set(GPIOA, GPIO_MODE_INPUT, GPIO_PUPD_NONE, GPIO_PIN_6);
    }
#endif
}

/* TMS_OEN复用模式控制  1自动 0手动 */
static void TmsOenAfMode(bool bit_enable) {
    if (bit_enable) {
        gpio_mode_set(GPIOD, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_12);
        gpio_af_set(GPIOD, GPIO_AF_2, GPIO_PIN_12); /* T3 */
    } else {
        gpio_mode_set(GPIOD, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, GPIO_PIN_12);
    }
}

