teledoge618/DAP_GD32F407/source/cmsis_dap/dap_port.c
/* TMS复用模式控制 1自动 0手动 */
static void TmsAfMode(bool bit_enable) {
    if (bit_enable) {
        /* TMS_CTL */
        gpio_af_set(GPIOA, GPIO_AF_5, GPIO_PIN_6);
        gpio_mode_set(GPIOA, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_6);
        /* TMS_RET */
        gpio_af_set(GPIOA, GPIO_AF_5, GPIO_PIN_7);
        gpio_mode_set(GPIOA, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_7);
    } else {
        gpio_mode_set(GPIOA, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, GPIO_PIN_6);
        gpio_mode_set(GPIOA, GPIO_MODE_INPUT, GPIO_PUPD_NONE, GPIO_PIN_7);
    }
}

/* TMS写 */
static void TmsWrite(bool bit_out) {
#if 1
    TMS_CTL_DO() = bit_out;
#else
    if (bit_out) {
        gpio_bit_set(GPIOA, GPIO_PIN_6);
    } else {
        gpio_bit_reset(GPIOA, GPIO_PIN_6);
    }
#endif
}

/* TMS读 */
static bool TmsRead() {
    return gpio_input_bit_get(GPIOA, GPIO_PIN_6);  //
}

/* TCK默认电平 TCK_DCTL */
static void TckPull(bool bit_out) {
    if (bit_out) {
        gpio_mode_set(GPIOD, GPIO_MODE_INPUT, GPIO_PUPD_PULLUP, GPIO_PIN_15);
    } else {
        gpio_mode_set(GPIOD, GPIO_MODE_INPUT, GPIO_PUPD_PULLDOWN, GPIO_PIN_15);
    }
}

/* TCK传输方向控制 */
static void TckOen(bool bit_enable) {
    if (bit_enable) {
        gpio_bit_set(GPIOC, GPIO_PIN_6);
    } else {
        gpio_bit_reset(GPIOC, GPIO_PIN_6);
    }
}

/**
 * @brief
 *
 */
void DAP_Port_InitHardware(void) {
    rcu_periph_clock_enable(RCU_SPI0);
    rcu_periph_clock_enable(RCU_SPI2);
    rcu_periph_clock_enable(RCU_TIMER0);
    rcu_periph_clock_enable(RCU_TIMER3);
    rcu_periph_clock_enable(RCU_TIMER4);
    rcu_periph_clock_enable(RCU_TIMER5);

    /* LED RUNNING = PE0 */
    gpio_bit_set(GPIOE, GPIO_PIN_0);
    gpio_mode_set(GPIOE, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, GPIO_PIN_0);
    gpio_output_options_set(GPIOE, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_0);

    /* LED CONNECT = PE1 */
    gpio_bit_set(GPIOE, GPIO_PIN_1);
    gpio_mode_set(GPIOE, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, GPIO_PIN_1);
    gpio_output_options_set(GPIOE, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_1);

    /* LED VOUT_EN = PE3 */
    gpio_bit_reset(GPIOE, GPIO_PIN_3);
    gpio_mode_set(GPIOE, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, GPIO_PIN_3);
    gpio_output_options_set(GPIOE, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_3);

    /* 定时器计数频率等于AHB */
    rcu_timer_clock_prescaler_config(RCU_TIMER_PSC_MUL4);

    /* SPI0 APB2 AHB/2 160/2 = 80M */
    spi_parameter_struct spi0_initpara;
    spi_i2s_deinit(SPI0);
    spi_struct_para_init(&spi0_initpara);
    spi0_initpara.clock_polarity_phase = SPI_CK_PL_HIGH_PH_2EDGE;
    spi0_initpara.device_mode = SPI_SLAVE; /* 从机 */
    spi0_initpara.endian = SPI_ENDIAN_LSB;
    spi0_initpara.frame_size = SPI_FRAMESIZE_8BIT;
    spi0_initpara.trans_mode = SPI_TRANSMODE_FULLDUPLEX; /* 全双工 */
    spi0_initpara.nss = SPI_NSS_SOFT;
    spi0_initpara.prescale = SPI_PSC_2; /* 从机无意义，设为最高速度 */
    spi_init(SPI0, &spi0_initpara);
    SPI0_DISABLE();
    SPI0_INT_RBNE_ENABLE();
    spi_i2s_interrupt_enable(SPI0, SPI_I2S_INT_RBNE);
    nvic_irq_enable(SPI0_IRQn, 0, 0);

    /* SPI2 APB1 AHB/4 160/4 = 40M */
    spi_parameter_struct spi2_initpara;
    spi_i2s_deinit(SPI2);
    spi_struct_para_init(&spi2_initpara);
    spi2_initpara.clock_polarity_phase = SPI_CK_PL_HIGH_PH_2EDGE;
    spi2_initpara.device_mode = SPI_SLAVE; /* 从机 */
    spi2_initpara.endian = SPI_ENDIAN_LSB;
    spi2_initpara.frame_size = SPI_FRAMESIZE_8BIT;
    spi2_initpara.trans_mode = SPI_TRANSMODE_FULLDUPLEX; /* 全双工 */
    spi2_initpara.nss = SPI_NSS_SOFT;
    spi2_initpara.prescale = SPI_PSC_2; /* 从机无意义，设为最高速度 */
    spi_init(SPI2, &spi2_initpara);
    SPI2_DISABLE();
    SPI2_INT_RBNE_ENABLE();
    spi_i2s_interrupt_enable(SPI2, SPI_I2S_INT_RBNE);
    nvic_irq_enable(SPI2_IRQn, 0, 0);

    /* TIMER0 */
    timer_deinit(TIMER0);
    timer_parameter_struct timer0_initpara;
    timer_struct_para_init(&timer0_initpara);
    timer0_initpara.prescaler = 0U;
    timer0_initpara.alignedmode = TIMER_COUNTER_UP;
    timer0_initpara.counterdirection = TIMER_COUNTER_UP;
    timer0_initpara.period = (SystemCoreClock / dap_data.frequency) - 1U;
    timer0_initpara.clockdivision = TIMER_CKDIV_DIV1;
    timer0_initpara.repetitioncounter = 8U - 1U;
    timer_init(TIMER0, &timer0_initpara);
    timer_single_pulse_mode_config(TIMER0, TIMER_SP_MODE_SINGLE);

    timer_oc_parameter_struct timer0_ocintpara;
    timer0_ocintpara.outputstate = TIMER_CCX_ENABLE;
    timer0_ocintpara.outputnstate = TIMER_CCXN_DISABLE;
    timer0_ocintpara.ocpolarity = TIMER_OC_POLARITY_HIGH;
    timer0_ocintpara.ocnpolarity = TIMER_OCN_POLARITY_HIGH;
    timer0_ocintpara.ocidlestate = TIMER_OC_IDLE_STATE_HIGH;
    timer0_ocintpara.ocnidlestate = TIMER_OCN_IDLE_STATE_HIGH;
    timer_channel_output_config(TIMER0, TIMER_CH_0, &timer0_ocintpara);

    timer_channel_output_pulse_value_config(TIMER0, TIMER_CH_0, (SystemCoreClock / dap_data.frequency) / 2);
    timer_channel_output_mode_config(TIMER0, TIMER_CH_0, TIMER_OC_MODE_PWM0);
    timer_channel_output_shadow_config(TIMER0, TIMER_CH_0, TIMER_OC_SHADOW_ENABLE);
    timer_primary_output_config(TIMER0, ENABLE);
    timer_auto_reload_shadow_disable(TIMER0);

    timer_master_output_trigger_source_select(TIMER0, TIMER_TRI_OUT_SRC_ENABLE); /* 输出使能信号 */
    timer_master_slave_mode_config(TIMER0, TIMER_MASTER_SLAVE_MODE_ENABLE);
    // timer_interrupt_enable(TIMER0, TIMER_INT_UP);
    // nvic_irq_enable(TIMER0_UP_TIMER9_IRQn, 0, 0); /* 中断太慢 */

    /* TIMER3 */
    timer_deinit(TIMER3);
    timer_parameter_struct timer3_initpara;
    timer_struct_para_init(&timer3_initpara);
    timer3_initpara.prescaler = 0U;
    timer3_initpara.alignedmode = TIMER_COUNTER_UP;
    timer3_initpara.counterdirection = TIMER_COUNTER_UP;
    timer3_initpara.period = (SystemCoreClock / dap_data.frequency) * 8 - 1U;
    timer3_initpara.clockdivision = TIMER_CKDIV_DIV1;
    timer3_initpara.repetitioncounter = 0U;
    timer_init(TIMER3, &timer3_initpara);
    // timer_single_pulse_mode_config(TIMER3, TIMER_SP_MODE_SINGLE);
    timer_dma_transfer_config(TIMER3, TIMER_DMACFG_DMATA_CH0CV, TIMER_DMACFG_DMATC_2TRANSFER);
    timer_channel_dma_request_source_select(TIMER3, TIMER_DMAREQUEST_UPDATEEVENT);

    timer_oc_parameter_struct timer3_ocintpara;
    timer3_ocintpara.outputstate = TIMER_CCX_ENABLE;
    timer3_ocintpara.outputnstate = TIMER_CCXN_DISABLE;
    timer3_ocintpara.ocpolarity = TIMER_OC_POLARITY_HIGH;
    timer3_ocintpara.ocnpolarity = TIMER_OCN_POLARITY_HIGH;
    timer3_ocintpara.ocidlestate = TIMER_OC_IDLE_STATE_HIGH;
    timer3_ocintpara.ocnidlestate = TIMER_OCN_IDLE_STATE_HIGH;
    timer_channel_output_config(TIMER3, TIMER_CH_0, &timer3_ocintpara);
    timer_channel_output_config(TIMER3, TIMER_CH_1, &timer3_ocintpara);

    timer_channel_output_pulse_value_config(TIMER3, TIMER_CH_0, 0xFFFF);
    timer_channel_output_pulse_value_config(TIMER3, TIMER_CH_1, 0xFFFF);
    timer_channel_output_mode_config(TIMER3, TIMER_CH_0, TIMER_OC_MODE_PWM0);
    timer_channel_output_mode_config(TIMER3, TIMER_CH_1, TIMER_OC_MODE_PWM0);
    timer_channel_output_shadow_config(TIMER3, TIMER_CH_0, TIMER_OC_SHADOW_ENABLE);
    timer_channel_output_shadow_config(TIMER3, TIMER_CH_1, TIMER_OC_SHADOW_ENABLE);
    timer_auto_reload_shadow_disable(TIMER3);

    timer_slave_mode_select(TIMER3, TIMER_SLAVE_MODE_RESTART);          /* 重置模式 */
    timer_input_trigger_source_select(TIMER3, TIMER_SMCFG_TRGSEL_ITI0); /* TIMER0 */
    // timer_interrupt_enable(TIMER3, TIMER_INT_UP);

    /* DMA SPI0 TX */
    dma_deinit(DMA1, DMA_CH5);
    dma_single_data_parameter_struct dma_spi_initpara;
    dma_spi_initpara.periph_addr = (uint32_t)&SPI_DATA(SPI0);
    dma_spi_initpara.periph_inc = DMA_PERIPH_INCREASE_DISABLE; /* 外设固定 */
    dma_spi_initpara.memory0_addr = (uint32_t)0;
    dma_spi_initpara.memory_inc = DMA_MEMORY_INCREASE_ENABLE;     /* 内存递增 */
    dma_spi_initpara.periph_memory_width = DMA_PERIPH_WIDTH_8BIT; /* 8bit */
    dma_spi_initpara.circular_mode = DMA_CIRCULAR_MODE_DISABLE;   /* 不循环 */
    dma_spi_initpara.direction = DMA_MEMORY_TO_PERIPH;
    dma_spi_initpara.number = 0xFFFF;
    dma_spi_initpara.priority = DMA_PRIORITY_MEDIUM;
    dma_single_data_mode_init(DMA1, DMA_CH5, &dma_spi_initpara);
    dma_channel_subperipheral_select(DMA1, DMA_CH5, DMA_SUBPERI3); /* SPI0 TX */
    dma_interrupt_enable(DMA1, DMA_CH5, DMA_INT_FTF);
    nvic_irq_enable(DMA1_Channel5_IRQn, 0, 2);

    /* DMA SPI0 RX */
    dma_deinit(DMA1, DMA_CH0);
    dma_spi_initpara.periph_addr = (uint32_t)&SPI_DATA(SPI0);
    dma_spi_initpara.periph_inc = DMA_PERIPH_INCREASE_DISABLE; /* 外设固定 */
    dma_spi_initpara.memory0_addr = (uint32_t)0;
    dma_spi_initpara.memory_inc = DMA_MEMORY_INCREASE_ENABLE;     /* 内存递增 */
    dma_spi_initpara.periph_memory_width = DMA_PERIPH_WIDTH_8BIT; /* 8bit */
    dma_spi_initpara.circular_mode = DMA_CIRCULAR_MODE_DISABLE;   /* 不循环 */
    dma_spi_initpara.direction = DMA_PERIPH_TO_MEMORY;
    dma_spi_initpara.number = 0xFFFF;
    dma_spi_initpara.priority = DMA_PRIORITY_MEDIUM;
    dma_single_data_mode_init(DMA1, DMA_CH0, &dma_spi_initpara);
    dma_channel_subperipheral_select(DMA1, DMA_CH0, DMA_SUBPERI3); /* SPI0 RX */
    dma_interrupt_enable(DMA1, DMA_CH0, DMA_INT_FTF);
    nvic_irq_enable(DMA1_Channel0_IRQn, 0, 2);

