teledoge618/DAP_GD32F407/source/cmsis_dap/dap_port.c
    /* DMA TIMER3 比较器 */
    dma_deinit(DMA0, DMA_CH6);
    dma_spi_initpara.periph_addr = (uint32_t)&TIMER_DMATB(TIMER3);
    dma_spi_initpara.periph_inc = DMA_PERIPH_INCREASE_DISABLE; /* 外设固定 */
    dma_spi_initpara.memory0_addr = (uint32_t)0;
    dma_spi_initpara.memory_inc = DMA_MEMORY_INCREASE_ENABLE;      /* 内存递增 */
    dma_spi_initpara.periph_memory_width = DMA_PERIPH_WIDTH_16BIT; /* 16bit */
    dma_spi_initpara.circular_mode = DMA_CIRCULAR_MODE_DISABLE;    /* 不循环 */
    dma_spi_initpara.direction = DMA_MEMORY_TO_PERIPH;
    dma_spi_initpara.number = 0xFFFF;
    dma_spi_initpara.priority = DMA_PRIORITY_HIGH; /* 优先级高 */
    dma_single_data_mode_init(DMA0, DMA_CH6, &dma_spi_initpara);
    dma_channel_subperipheral_select(DMA0, DMA_CH6, DMA_SUBPERI2); /* TIMER3 UP */
    dma_interrupt_enable(DMA0, DMA_CH6, DMA_INT_FTF);
    nvic_irq_enable(DMA0_Channel6_IRQn, 0, 3);

    /* TIMER4 时间戳 */
    timer_deinit(TIMER4);
    timer_parameter_struct timer4_initpara;
    timer_struct_para_init(&timer4_initpara);
    timer4_initpara.prescaler = SystemCoreClock / 1000000 - 1;
    timer4_initpara.alignedmode = TIMER_COUNTER_UP;
    timer4_initpara.counterdirection = TIMER_COUNTER_UP;
    timer4_initpara.period = 0xFFFFFFFF; /* 32bit */
    timer4_initpara.clockdivision = TIMER_CKDIV_DIV1;
    timer4_initpara.repetitioncounter = 0U;
    timer_init(TIMER4, &timer4_initpara);
    timer_enable(TIMER4);

    /* TIMER5 */
    timer_deinit(TIMER5);
    timer_parameter_struct timer5_initpara;
    timer_struct_para_init(&timer5_initpara);
    timer5_initpara.prescaler = SystemCoreClock / 1000000 - 1;
    timer5_initpara.alignedmode = TIMER_COUNTER_UP;
    timer5_initpara.counterdirection = TIMER_COUNTER_UP;
    timer5_initpara.period = 0xFFFF;
    timer5_initpara.clockdivision = TIMER_CKDIV_DIV1;
    timer5_initpara.repetitioncounter = 0U;
    timer_init(TIMER5, &timer5_initpara);
    timer_enable(TIMER5);
    timer_single_pulse_mode_config(TIMER5, TIMER_SP_MODE_SINGLE); /* 单脉冲 */

    DAP_Port_SWJ_Disconnect();
}

/**
 * @brief 设置Running灯的状态
 *
 * @param bit
 */
void DAP_Port_SetRunningStatus(uint8_t bit) {
    /* LED RUNNING = PE0 */
    if (bit) {
        gpio_bit_reset(GPIOE, GPIO_PIN_0);
    } else {
        gpio_bit_set(GPIOE, GPIO_PIN_0);
    }
}

/**
 * @brief 设置Connected灯的状态
 *
 * @param bit
 */
void DAP_Port_SetConnectedStatus(uint8_t bit) {
    /* LED CONNECT = PE1 */
    if (bit) {
        gpio_bit_reset(GPIOE, GPIO_PIN_1);
    } else {
        gpio_bit_set(GPIOE, GPIO_PIN_1);
    }
}

/**
 * @brief 初始化SWD端口
 *
 */
void DAP_Port_SWD_Connect(void) {
    /*
    SWD模式
    TCK_CLT:
        -PA8:  T0_CH0,    AF1  OUT 主时钟输出
        -PC10: SPI2_SCK,  AF6  IN  SPI从机时钟
        -PB3:  SPI0_SCK,  AF5  IN  SPI从机时钟
    SCK_OEN:
        -PD13: T3_CH1,    AF2  OUT 时钟输出使能
    TCK_OEN:
        -PC6:                  OUT TCK引脚输出使能
    TCK_DCTL:
        -PD15:                 OUT 高阻时默认电平
    TMS_CTL:
        -PA6:  SPI0_MISO, AF5  OUT SPI从机输出
    TMS_ERT:
        -PA7:  SPI0_MOSI, AF5  IN  SPI从机输入
    TMS_OEN:
        -PD12: T3_CH0,    AF2  OUT
    */

    /* TCK_CTL T0时钟输出，SPI0/2输入 */
    gpio_bit_set(GPIOA, GPIO_PIN_8);
    gpio_af_set(GPIOA, GPIO_AF_1, GPIO_PIN_8);                      /* T0_CH0 */
    gpio_mode_set(GPIOA, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_8); /* T0 */
    gpio_output_options_set(GPIOA, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_8);

    gpio_af_set(GPIOC, GPIO_AF_6, GPIO_PIN_10); /* SPI0 */
    gpio_mode_set(GPIOC, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_10);

    gpio_af_set(GPIOB, GPIO_AF_5, GPIO_PIN_3); /* SPI2 */
    gpio_mode_set(GPIOB, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_3);

    /* TCK_OEN */
    TckOen(1);

    /* TCK_DCTL 默认电平高 */
    TckPull(1);

    /* TMS_CTL TMS_ERT 切到SPI0 */
    TmsAfMode(1);

    /* TMS_OEN */
    TmsOen(1);
    TmsOenAfMode(0);

    SPI0_DISABLE();
    SPI2_DISABLE();
    SPI0_INT_RBNE_ENABLE();
    SPI2_INT_RBNE_ENABLE();
}

/**
 * @brief 初始化JTAG端口
 *
 */
void DAP_Port_JTAG_Connect(void) {
    /*
    JTAG模式
    TCK_CLT:
        -PA8:  T0_CH0,    AF1  OUT 主时钟输出
        -PC10: SPI2_SCK,  AF6  IN  SPI从机时钟
        -PB3:  SPI0_SCK,  AF5  IN  SPI从机时钟
    SCK_OEN:
        -PD13: T3_CH1,    AF2  OUT 时钟输出使能
    TCK_OEN:
        -PC6:                  OUT TCK引脚输出使能
    TCK_DCTL:
        -PD15:                 OUT 高阻时默认电平
    TMS_CTL:
        -PA6:  SPI0_MISO, AF5  OUT SPI从机输出
    TMS_ERT:
        -PA7:  SPI0_MOSI, AF5  IN  SPI从机输入
    TMS_OEN:
        -PD12: T3_CH0,    AF2  OUT
    TDI_CTL:
        -PC11: SPI2_MISO  AF6  OUT SPI输出
    TDI_OEN:
        -PC8:  GPIO            OUT
    TDO_CTL:
        -PD6:  SPI2_MOSI  AF5  IN  SPI输入
    TDO_OEN:
        -PA2:  GPIO            OUT
    */

    /* TCK_CTL */
    gpio_bit_set(GPIOA, GPIO_PIN_8);
    gpio_af_set(GPIOA, GPIO_AF_1, GPIO_PIN_8); /* T0_CH0 */
    gpio_mode_set(GPIOA, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_8);
    gpio_output_options_set(GPIOA, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_8);

    gpio_af_set(GPIOC, GPIO_AF_6, GPIO_PIN_10); /* SPI0 SCK */
    gpio_mode_set(GPIOC, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_10);

    gpio_af_set(GPIOB, GPIO_AF_5, GPIO_PIN_3); /* SPI2 SCK */
    gpio_mode_set(GPIOB, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_3);

    /* TCK_OEN */
    TckOen(1);

    /* TCK_DCTL */
    TckPull(1);

    /* TMS_CTL TMS_ERT */
    TmsAfMode(1);
    TmsWrite(0);

    /* TMS_OEN */
    TmsOen(1);
    TmsOenAfMode(0);

    /* TDI_CTL 切到SPI2输出 */
    gpio_af_set(GPIOC, GPIO_AF_6, GPIO_PIN_11); /* SPI2 MISO */
    gpio_mode_set(GPIOC, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_11);

    /* TDI_OEN 拉高 */
    gpio_bit_set(GPIOC, GPIO_PIN_8);

    /* TDO_CTL 切到SPI2输入 */
    gpio_af_set(GPIOD, GPIO_AF_5, GPIO_PIN_6); /* SPI2 MOSI */
    gpio_mode_set(GPIOD, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_6);

    /* TDO_OEN 拉低 */
    gpio_bit_reset(GPIOA, GPIO_PIN_2);

    SPI0_DISABLE();
    SPI2_DISABLE();
    SPI0_INT_RBNE_ENABLE();
    SPI2_INT_RBNE_ENABLE();
}

/**
 * @brief 所有引脚设为高阻输入状态
 *
 */
void DAP_Port_SWJ_Disconnect(void) {
    /* TCK_CTL PA8 PC10 PB3 */
    gpio_af_set(GPIOA, GPIO_AF_1, GPIO_PIN_8); /* T0_CH0 */
    gpio_mode_set(GPIOA, GPIO_MODE_INPUT, GPIO_PUPD_NONE, GPIO_PIN_8);
    gpio_output_options_set(GPIOA, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_8);

    gpio_af_set(GPIOC, GPIO_AF_6, GPIO_PIN_10); /* SPI0 SCK */
    gpio_mode_set(GPIOC, GPIO_MODE_INPUT, GPIO_PUPD_NONE, GPIO_PIN_10);

    gpio_af_set(GPIOB, GPIO_AF_5, GPIO_PIN_3); /* SPI2 SCK */
    gpio_mode_set(GPIOB, GPIO_MODE_INPUT, GPIO_PUPD_NONE, GPIO_PIN_3);

    /* SCK_OEN PD13 控制TCK周期个数 */
    gpio_af_set(GPIOD, GPIO_AF_2, GPIO_PIN_13); /* T3_CH1 */
    gpio_mode_set(GPIOD, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_13);
    gpio_output_options_set(GPIOD, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_13);

    /* TCK_OEN */
    gpio_bit_reset(GPIOC, GPIO_PIN_6); /* IN */
    gpio_mode_set(GPIOC, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, GPIO_PIN_6);
    gpio_output_options_set(GPIOC, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_6);

