teledoge618/DAP_GD32F407/source/cmsis_dap/dap_port.c
    /* TMS_CTL */
    gpio_mode_set(GPIOA, GPIO_MODE_INPUT, GPIO_PUPD_NONE, GPIO_PIN_6);
    gpio_output_options_set(GPIOA, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_6);

    /* TMS_ERT */
    gpio_mode_set(GPIOA, GPIO_MODE_INPUT, GPIO_PUPD_NONE, GPIO_PIN_7);

    /* TMS_OEN */
    gpio_bit_reset(GPIOD, GPIO_PIN_12); /* IN */
    gpio_mode_set(GPIOD, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, GPIO_PIN_12);
    gpio_output_options_set(GPIOD, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_12);

    /* TDI_CTL */
    gpio_mode_set(GPIOC, GPIO_MODE_INPUT, GPIO_PUPD_NONE, GPIO_PIN_11);
    gpio_output_options_set(GPIOC, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_11);
    gpio_mode_set(GPIOC, GPIO_MODE_INPUT, GPIO_PUPD_NONE, GPIO_PIN_12);
    gpio_output_options_set(GPIOC, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_12);

    /* TDI_OEN */
    gpio_bit_reset(GPIOC, GPIO_PIN_8); /* IN */
    gpio_mode_set(GPIOC, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, GPIO_PIN_8);
    gpio_output_options_set(GPIOC, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_8);

    /* TDO_CTL */
    gpio_mode_set(GPIOD, GPIO_MODE_INPUT, GPIO_PUPD_NONE, GPIO_PIN_6);

    /* TDO_OEN */
    gpio_bit_reset(GPIOA, GPIO_PIN_2); /* IN */
    gpio_mode_set(GPIOA, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, GPIO_PIN_2);
    gpio_output_options_set(GPIOA, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_2);

    /* RTCK_CTL */
    gpio_mode_set(GPIOE, GPIO_MODE_INPUT, GPIO_PUPD_NONE, GPIO_PIN_2);

    /* RTCK_OEN */
    gpio_bit_reset(GPIOE, GPIO_PIN_4); /* IN */
    gpio_mode_set(GPIOE, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, GPIO_PIN_4);
    gpio_output_options_set(GPIOE, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_4);

    /* DBGRQ_CTL */
    gpio_mode_set(GPIOA, GPIO_MODE_INPUT, GPIO_PUPD_NONE, GPIO_PIN_1);

    /* DBGRQ_OEN */
    gpio_bit_reset(GPIOC, GPIO_PIN_1); /* IN */
    gpio_mode_set(GPIOC, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, GPIO_PIN_1);
    gpio_output_options_set(GPIOC, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_1);

    /* TRST_CTL */
    gpio_mode_set(GPIOD, GPIO_MODE_INPUT, GPIO_PUPD_NONE, GPIO_PIN_14);

    /* TRST_OEN */
    gpio_bit_reset(GPIOB, GPIO_PIN_14); /* IN */
    gpio_mode_set(GPIOB, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, GPIO_PIN_14);
    gpio_output_options_set(GPIOB, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_14);

    /* SRST_CTL NPN开漏输出 */
    gpio_mode_set(GPIOA, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, GPIO_PIN_0);
    gpio_bit_reset(GPIOA, GPIO_PIN_0);
}

/**
 * @brief 阻塞延时
 *
 * @param delay_us 微秒
 */
void DAP_Port_Delay(uint32_t delay_us) {
    while (delay_us > 0xFFFF) {
        timer_counter_value_config(TIMER5, 0xFFFF);
        T5_ENABLE();
        while (T5_IS_ENABLE()) {
        }
        delay_us -= 0xFFFF;
    }

    timer_counter_value_config(TIMER5, 0xFFFF - delay_us);
    T5_ENABLE();
    while (T5_IS_ENABLE()) {
    }
}

/**
 * @brief 复位目标芯片
 *
 * @return uint8_t 1复位，0未实现
 */
uint8_t DAP_Port_ResetTarget(void) {
    // TODO
    return 0;
}

/**
 * @brief 设置引脚状态
 *
 * @param select
 * @param value
 */
void DAP_Port_SetPins(uint8_t select, uint8_t value) {
    /*
    Bit 0: SWCLK/TCK
    Bit 1: SWDIO/TMS
    Bit 2: TDI
    Bit 3: TDO
    Bit 5: nTRST
    Bit 7: nRESET
    */

    if (select & (1 << DAP_SWJ_nRESET)) {
        gpio_bit_write(GPIOA, GPIO_PIN_0, (value >> DAP_SWJ_nRESET) & 0x01);
    }
}

/**
 * @brief 读取引脚状态
 *
 * @return uint8_t
 */
uint8_t DAP_Port_GetPins(void) {
    uint8_t pins_value = 0;
    /*
    Bit 0: SWCLK/TCK
    Bit 1: SWDIO/TMS
    Bit 2: TDI
    Bit 3: TDO
    Bit 5: nTRST
    Bit 7: nRESET
    */

    if (gpio_input_bit_get(GPIOA, GPIO_PIN_0)) {
        pins_value |= (1U << DAP_SWJ_nRESET);
    }

    return pins_value;
}

/**
 * @brief 设置时钟输出频率
 *
 * @param freq
 */
void DAP_Port_SWJ_SetClock(uint32_t freq) {
    if (freq == 0) {
        freq = DAP_DEFAULT_SWJ_CLOCK;
        return;
    }
    if (freq > SystemCoreClock / 4) {
        freq = SystemCoreClock / 4; /* 上限SYS/4 */
    }
    if (freq < 40 * 1000) { /* 下限40K */
        if (freq < 10) {
            freq = 10;
        }
    }

    /* 计算每个周期的计数值 */
    uint32_t timer0_period = SystemCoreClock / freq;

    if (timer0_period > 4000) {
        uint32_t timer_psc = timer0_period / 4000;
        timer_prescaler_config(TIMER0, timer_psc - 1, TIMER_PSC_RELOAD_NOW);
        timer_prescaler_config(TIMER3, timer_psc - 1, TIMER_PSC_RELOAD_NOW);

        timer0_period /= timer_psc;
    } else {
        timer_prescaler_config(TIMER0, 0, TIMER_PSC_RELOAD_NOW);
        timer_prescaler_config(TIMER3, 0, TIMER_PSC_RELOAD_NOW);
    }
    dap_data.frequency = freq;
    ULOG_DEBUG("dap freq: %d Hz\r\n", freq);

    /* 设置TIMER0的计数值和比较值 */
    timer_autoreload_value_config(TIMER0, timer0_period - 1U);
    timer_autoreload_value_config(TIMER3, (timer0_period * 8) - 1U);
    timer_channel_output_pulse_value_config(TIMER0, TIMER_CH_0, timer0_period / 2U); /* 50%占空比 */
    T0_SOFT_UPDATE();                                                                /* 手动更新进去 */
    T0_UP_FLAG_CLEAR();

    swj_timer0_cnt = timer0_period;
}

/**
 * @brief 输出数据序列
 *
 * @param count 比特数
 * @param value 串行数据
 */
void DAP_Port_SWJ_Sequence(uint32_t count, uint8_t *value) {
    uint8_t n_bit;

    /* 0代表256 */
    if (count == 0) {
        count = 256;
    }

    TMS_OEN_DO() = 1;       /* 输出 */
    SPI0_INT_RBNE_ENABLE(); /* 抛弃收到的数据 */
    SPI0_ENABLE();

    while (count > 0) {
        if (count > 8) {
            n_bit = 8;
        } else {
            n_bit = count;
        }
        count -= n_bit;

        spi_i2s_data_transmit(SPI0, *value);
        tck_cycle_n(n_bit);
        value++;
    }

    SPI0_DISABLE();
}

/**
 * @brief 输出SWD序列
 *
 * @param info
 * @param request
 * @param response
 */
void DAP_Port_SWD_Sequence(uint8_t info, const uint8_t *request, uint8_t *response) {
    uint8_t count = info & SWD_SEQUENCE_CLK;
    if (count == 0) {
        count = 64;
    }

    /* 需要捕获输入值 */
    uint8_t need_receive = ((info & SWD_SEQUENCE_DIN) > 0);
    TMS_OEN_DO() = !need_receive;

    if (need_receive) {
        while (SPI0_RBNE()) {
        }
        SPI0_INT_RBNE_DISABLE();
    } else {
        SPI0_INT_RBNE_ENABLE(); /* 抛弃 */
    }

    SPI0_ENABLE();

    while (count > 0) {
        uint8_t n_bit;
        if (count > 8) {
            n_bit = 8;
        } else {
            n_bit = count;
        }
        count -= n_bit;

