teledoge618/DAP_GD32F407/source/cmsis_dap/dap_port.c
        if (need_receive) {
            spi_i2s_data_transmit(SPI0, 0x00);
        } else {
            spi_i2s_data_transmit(SPI0, *request); /* 输出 */
            request++;
        }

        tck_cycle_n(n_bit);

        if (need_receive) {
            *response = spi_i2s_data_receive(SPI0); /* 输入 */
            response++;
        }
    }

    SPI0_INT_RBNE_ENABLE();
    SPI0_DISABLE();
    TMS_OEN_DO() = 1;
}

/**
 * @brief SWD传输
 *
 * @param request
 * @param response
 * @return uint32_t
 */
uint8_t DAP_Port_SWD_Transfer(uint32_t request, uint8_t *response) {
    /* 计算奇偶校验，奇1偶0 */
    uint8_t req_raw = request & 0x0F;
    uint8_t req_parity = parity_mapping_table[req_raw] & 0x01;
    uint8_t req = 0x81 | ((req_raw) << 1) | (req_parity << 5); /* req 8bit */
    uint8_t read_n_write = (request & DAP_TRANSFER_RnW) ? 0x01 : 0x00;

    /* 发request **************************************************************/

    TMS_OEN_DO() = 1;       /* 输出 */
    SPI0_INT_RBNE_ENABLE(); /* 抛弃接收的数据 */
    SPI0_ENABLE();
    spi_i2s_data_transmit(SPI0, req);
    tck_cycle_n(8);
    // SPI0_DISABLE();

    /* 收ACK ******************************************************************/

    uint8_t trn_num = (read_n_write == 1U) ? 1U : 2U;                /* W-R-R 1trn cycle / W-R-W 2trn cycle */
    uint8_t ack_cycle = 3U + dap_data.swd_conf.turnaround * trn_num; /* 3 ACK + trn */
    if (ack_cycle > 8U) {
        if (ack_cycle > 16U) {
            /* 不可能出现，trn周期最多只有4，4+3+4=11 */
            ULOG_ERROR("ACK over length\r\n");
            return DAP_TRANSFER_ERROR; /* 不支持 */
        }
        spi_i2s_data_frame_format_config(SPI0, SPI_FRAMESIZE_16BIT);
    }

    TMS_OEN_DO() = 0; /* 输入 */
    while (SPI0_RBNE()) {
    }
    SPI0_INT_RBNE_DISABLE(); /* 手动接收 */

    // SPI0_ENABLE();
    if (ack_cycle > 8) {
        tck_cycle_n(8);
        tck_cycle_n(ack_cycle - 8);
    } else {
        tck_cycle_n(ack_cycle);
    }

    uint16_t ack_raw = spi_i2s_data_receive(SPI0);
    uint8_t ack = 0x07 & (ack_raw >> dap_data.swd_conf.turnaround); /* 去掉trn */

    SPI0_INT_RBNE_ENABLE();
    SPI0_DISABLE();

    /* 恢复8bit长度 */
    if (ack_cycle > 8U) {
        spi_i2s_data_frame_format_config(SPI0, SPI_FRAMESIZE_8BIT);
    }

    uint8_t need_data_phase = 1; /* 需要生成数据序列 */
    if (ack == DAP_TRANSFER_OK) {
        need_data_phase = 1;

        if (request & DAP_TRANSFER_TIMESTAMP) {
            dap_data.timestamp = DAP_Port_GetTimeStamp();
        }
    } else if ((ack == DAP_TRANSFER_WAIT) || (ack == DAP_TRANSFER_FAULT)) {
        need_data_phase = dap_data.swd_conf.data_phase;
    }

    /* data *******************************************************************/

    if (need_data_phase) {
        /* WDATA校验值 */
        uint8_t wdata_parity = 0x01 & (parity_mapping_table[response[0]] + parity_mapping_table[response[1]]  //
                                       + parity_mapping_table[response[2]] + parity_mapping_table[response[3]]);

        if (read_n_write) {
            TMS_OEN_DO() = 0; /* 输入 */

            while (SPI0_RBNE()) {
            }
            SPI0_INT_RBNE_DISABLE();
            dma_memory_address_config(DMA1, DMA_CH0, DMA_MEMORY_0, (uint32_t)spi_rdata_buf); /* RX */
            dma_transfer_number_config(DMA1, DMA_CH0, 4);                                    /* SPI0 */
            DMA1_CH0_ENABLE();
            SPI0_DMA_RX_ENABLE(); /* RX */
        } else {
            TMS_OEN_DO() = 1; /* 输出 */

            dma_memory_address_config(DMA1, DMA_CH5, DMA_MEMORY_0, (uint32_t)response); /* TX */
            dma_transfer_number_config(DMA1, DMA_CH5, 4);                               /* SPI0 */
            DMA1_CH5_ENABLE();
            SPI0_DMA_TX_ENABLE(); /* TX */
        }

        SPI0_ENABLE();
        tck_cycle_byte(4); /* 4*8=32 */

        if (read_n_write) {
            while (DMA1_CH0_IS_ENABLE()) {
            }

            SPI0_DMA_RX_DISABLE();
            response[0] = spi_rdata_buf[0];
            response[1] = spi_rdata_buf[1];
            response[2] = spi_rdata_buf[2];
            response[3] = spi_rdata_buf[3];
        } else {
            SPI0_DMA_TX_DISABLE();
        }

        SPI0_INT_RBNE_ENABLE();
        SPI0_DISABLE();

        /* 1bit校验位 和 可能的转换位 *******************/

        SPI0_ENABLE();
        while (SPI0_RBNE()) {
        }
        SPI0_INT_RBNE_DISABLE();
        spi_i2s_data_transmit(SPI0, wdata_parity);
        tck_cycle_n(dap_data.swd_conf.turnaround * read_n_write + 1U);

        if (read_n_write) {
            /* 计算校验值 */
            uint8_t rdata_parity = 0x01 & spi_i2s_data_receive(SPI0);
            uint8_t p = 0x01 & (parity_mapping_table[spi_rdata_buf[0]] + parity_mapping_table[spi_rdata_buf[1]]  //
                                + parity_mapping_table[spi_rdata_buf[2]] + parity_mapping_table[spi_rdata_buf[3]]);

            if (p != rdata_parity) {
                ack = DAP_TRANSFER_ERROR; /* 校验值错误 */
                ULOG_ERROR("data parity error\r\n");
            }
        }

        SPI0_INT_RBNE_ENABLE();
        SPI0_DISABLE();
        TMS_OEN_DO() = 1; /* 恢复控制权 */

        /* 写指令后需要添加空闲周期 */
        uint8_t idle_count = dap_data.transfer.idle_cycles;
        if ((!read_n_write) && (idle_count > 0)) {
            SPI0_ENABLE();
            spi_i2s_data_transmit(SPI0, 0x00);
            while (idle_count > 0) {
                uint8_t idle_bit;
                if (idle_count > 8) {
                    idle_bit = 8;
                } else {
                    idle_bit = idle_count;
                }
                idle_count -= idle_bit;
                tck_cycle_n(idle_bit);
            }
            SPI0_DISABLE();
        }
    } else {
        if (read_n_write) {
            /* 读操作失败添加一个trn周期，重新掌握数据线控制权 */
            tck_cycle_n(dap_data.swd_conf.turnaround);
        }
    }

    TMS_OEN_DO() = 1; /* 输出 */
    return ack;
}

/**
 * @brief 输出JTAG序列
 *
 * @param info
 * @param request
 * @param response
 */
void DAP_Port_JTAG_Sequence(uint8_t info, const uint8_t *request, uint8_t *response) {
    uint32_t n_bit;

    /* 周期数 */
    uint32_t count = info & JTAG_SEQUENCE_TCK;
    if (count == 0) {
        count = 64;
    }

