teledoge618/DAP_GD32F407/source/cmsis_dap/dap_port.c
    bool need_receive = (info & JTAG_SEQUENCE_TDO) > 0;

    SPI0_INT_RBNE_ENABLE();
    if (need_receive) {
        SPI2_INT_RBNE_DISABLE();
    } else {
        SPI2_INT_RBNE_ENABLE();
    }

    SPI0_ENABLE();
    SPI2_ENABLE();
    while (count > 0) {
        if (count > 8) {
            n_bit = 8;
        } else {
            n_bit = count;
        }
        count -= n_bit;

        if (need_receive) {
            spi_i2s_data_transmit(SPI2, 0xFF);
        } else {
            spi_i2s_data_transmit(SPI2, *request); /* 发送 */
            request++;
        }
        spi_i2s_data_transmit(SPI0, (info & JTAG_SEQUENCE_TMS) ? 0xFF : 0x00); /* 保持TMS以维持TAP状态 */
        tck_cycle_n(n_bit);

        if (need_receive) {
            while (!SPI0_RBNE()) {
            }
            *response = spi_i2s_data_receive(SPI2); /* 接收 */
            response++;
        }
    }

    SPI0_DISABLE();
    SPI2_DISABLE();
    SPI2_INT_RBNE_ENABLE();
}

/**
 * @brief JTAG传输
 *
 * @param request
 * @param data
 * @return uint8_t
 */
uint8_t DAP_Port_JTAG_Transfer(uint32_t request, uint8_t *rwdata) {
    /* Run-Test/Idle -> Shift-DR **********************************************/

    SPI0_ENABLE();
    SPI0_INT_RBNE_ENABLE();            /* 抛弃接收到的数据 */
    SPI2_INT_RBNE_ENABLE();            /* 抛弃接收到的数据 */
    spi_i2s_data_transmit(SPI0, B001); /* 1,0,0 */
    tck_cycle_n(3);                    /* 不能多，多了就写进IR了 */
    SPI0_DISABLE();

    /* TDO <- 0 <- 1 <- TDI    */

    /* 把数据从Bypass中推出来 */
    uint8_t bypass_num = dap_data.jtag_dev.index;
    if (bypass_num) {
        uint8_t i;

        SPI0_ENABLE();
        SPI2_ENABLE();
        while (bypass_num) {
            if (bypass_num > 8) {
                i = 8;
            } else {
                i = bypass_num;
            }
            bypass_num -= i;

            SPI0_INT_RBNE_ENABLE();
            spi_i2s_data_transmit(SPI0, 0x00); /* Shift-DR */
            spi_i2s_data_transmit(SPI2, 0x00);
            tck_cycle_n(i);
        }
        SPI0_DISABLE();
        SPI2_DISABLE();
    }

    /* 接收ACK并发送req */
    SPI0_ENABLE();
    SPI2_ENABLE();
    SPI2_INT_RBNE_DISABLE();
    spi_i2s_data_transmit(SPI0, 0x00);         /* Shift-DR */
    spi_i2s_data_transmit(SPI2, request >> 1); /* REQ */
    tck_cycle_n(3);
    SPI0_DISABLE();
    SPI2_DISABLE();

    uint8_t ack = spi_i2s_data_receive(SPI2) & 0x07;
    ack = ((ack & 0x01) << 1) | ((ack & 0x02) >> 1) | (ack & 0x04); /* 交换[0][1] */
    SPI2_INT_RBNE_ENABLE();

#if 0
    if (ack != DAP_TRANSFER_OK) {
        SPI0_ENABLE();
        SPI0_INT_RBNE_ENABLE();            /* 抛弃接收到的数据 */
        spi_i2s_data_transmit(SPI0, B011); /* 1,1,0 */
        tck_cycle_n(3);                    /* 不能多，多了就写进IR了 */
        SPI0_DISABLE();

        if (request & DAP_TRANSFER_TIMESTAMP) {
            dap_data.timestamp = DAP_Port_GetTimeStamp();
        }

        return ack;
    }
#endif
    if (request & DAP_TRANSFER_RnW) {
        /* 读操作 **************************************************************/

        SPI0_ENABLE();
        SPI2_ENABLE();
        SPI2_INT_RBNE_DISABLE();
        spi_i2s_data_transmit(SPI0, 0x00); /* Shift-DR */
        spi_i2s_data_transmit(SPI2, 0xFF); /*  */
        tck_cycle_n(8);
        rwdata[0] = spi_i2s_data_receive(SPI2);

        spi_i2s_data_transmit(SPI0, 0x00); /* Shift-DR */
        spi_i2s_data_transmit(SPI2, 0xFF); /*  */
        tck_cycle_n(8);
        rwdata[1] = spi_i2s_data_receive(SPI2);

        spi_i2s_data_transmit(SPI0, 0x00); /* Shift-DR */
        spi_i2s_data_transmit(SPI2, 0xFF); /*  */
        tck_cycle_n(8);
        rwdata[2] = spi_i2s_data_receive(SPI2);

        uint8_t n = dap_data.jtag_dev.count - dap_data.jtag_dev.index - 1U;
        if (n > 0) {
            spi_i2s_data_transmit(SPI0, 0x00); /* Shift-DR */
            spi_i2s_data_transmit(SPI2, 0xFF); /*  */
            tck_cycle_n(8);
            rwdata[3] = spi_i2s_data_receive(SPI2);

            SPI2_INT_RBNE_ENABLE();

            /* 把数据推到合适的位置 */
            while (n > 0) {
                uint8_t i;
                if (n > 8) {
                    i = 8;
                } else {
                    i = n;
                }
                n -= i;

                if (n) {
                    spi_i2s_data_transmit(SPI0, 0x00); /* Shift-DR */
                } else {
                    spi_i2s_data_transmit(SPI0, 0x01 << (i - 1)); /* Shift-DR -> Exit1-DR */
                }
                spi_i2s_data_transmit(SPI2, 0xFF); /*  */
                tck_cycle_n(i);
            }
        } else {
            spi_i2s_data_transmit(SPI0, 0x01 << 7); /* Shift-DR -> Exit1-DR */
            spi_i2s_data_transmit(SPI2, 0xFF);      /*  */
            tck_cycle_n(4);
            rwdata[3] = spi_i2s_data_receive(SPI2);

            SPI2_INT_RBNE_ENABLE();
        }
        SPI0_DISABLE();
        SPI2_DISABLE();
    } else {
        /* 写操作 **************************************************************/

        SPI0_ENABLE();
        SPI2_ENABLE();
        SPI0_INT_RBNE_ENABLE();
        SPI2_INT_RBNE_ENABLE();

        spi_i2s_data_transmit(SPI0, 0x00);      /* Shift-DR */
        spi_i2s_data_transmit(SPI2, rwdata[0]); /*  */
        tck_cycle_n(8);

        spi_i2s_data_transmit(SPI0, 0x00);      /* Shift-DR */
        spi_i2s_data_transmit(SPI2, rwdata[1]); /*  */
        tck_cycle_n(8);

        spi_i2s_data_transmit(SPI0, 0x00);      /* Shift-DR */
        spi_i2s_data_transmit(SPI2, rwdata[2]); /*  */
        tck_cycle_n(8);

        uint8_t n = dap_data.jtag_dev.count - dap_data.jtag_dev.index - 1U;
        if (n > 0) {
            spi_i2s_data_transmit(SPI0, 0x00);      /* Shift-DR */
            spi_i2s_data_transmit(SPI2, rwdata[3]); /*  */
            tck_cycle_n(8);

            /* 把数据推到合适的位置 */
            while (n > 0) {
                uint8_t i;
                if (n > 8) {
                    i = 8;
                } else {
                    i = n;
                }
                n -= i;

                if (n) {
                    spi_i2s_data_transmit(SPI0, 0x00); /* Shift-DR */
                } else {
                    spi_i2s_data_transmit(SPI0, 0x01 << (i - 1)); /* Shift-DR -> Exit1-DR */
                }
                spi_i2s_data_transmit(SPI2, 0xFF); /*  */
                tck_cycle_n(i);
            }
        } else {
            spi_i2s_data_transmit(SPI0, 0x01 << 7); /* Shift-DR -> Exit1-DR */
            spi_i2s_data_transmit(SPI2, rwdata[3]); /*  */
            tck_cycle_n(8);
        }

        SPI0_DISABLE();
        SPI2_DISABLE();
    }

