teledoge618/DAP_GD32F407/source/cmsis_dap/dap_port.c
    /* 退出 ********************************************************************/

    SPI0_ENABLE();
    SPI0_INT_RBNE_ENABLE();           /* 抛弃接收到的数据 */
    spi_i2s_data_transmit(SPI0, B01); /* 1,0 */
    tck_cycle_n(2);                   /* 不能多，多了就写进IR了 */
    SPI0_DISABLE();

    return ack;
}

#if 0
static uint8_t JTAG_Transfer(uint32_t request, uint32_t *data) {
    uint32_t ack;
    uint32_t bit;
    uint32_t val;
    uint32_t n;

    PIN_TMS_SET();
    JTAG_CYCLE_TCK(); /* Select-DR-Scan */
    PIN_TMS_CLR();
    JTAG_CYCLE_TCK(); /* Capture-DR */
    JTAG_CYCLE_TCK(); /* Shift-DR */

    for (n = DAP_Data.jtag_dev.index; n; n--) {
        JTAG_CYCLE_TCK(); /* Bypass before data */
    }

    JTAG_CYCLE_TDIO(request >> 1, bit); /* Set RnW, Get ACK.0 */
    ack = bit << 1;
    JTAG_CYCLE_TDIO(request >> 2, bit); /* Set A2,  Get ACK.1 */
    ack |= bit << 0;
    JTAG_CYCLE_TDIO(request >> 3, bit); /* Set A3,  Get ACK.2 */
    ack |= bit << 2;

    if (ack != DAP_TRANSFER_OK) {
        /* Exit on error */
        PIN_TMS_SET();
        JTAG_CYCLE_TCK(); /* Exit1-DR */
        goto exit;
    }

    if (request & DAP_TRANSFER_RnW) {
        /* Read Transfer */
        val = 0U;
        for (n = 31U; n; n--) {
            JTAG_CYCLE_TDO(bit); /* Get D0..D30 */
            val |= bit << 31;
            val >>= 1;
        }
        n = DAP_Data.jtag_dev.count - DAP_Data.jtag_dev.index - 1U;
        if (n) {
            JTAG_CYCLE_TDO(bit); /* Get D31 */
            for (--n; n; n--) {
                JTAG_CYCLE_TCK(); /* Bypass after data */
            }
            PIN_TMS_SET();
            JTAG_CYCLE_TCK(); /* Bypass & Exit1-DR */
        } else {
            PIN_TMS_SET();
            JTAG_CYCLE_TDO(bit); /* Get D31 & Exit1-DR */
        }
        val |= bit << 31;
        if (data) {
            *data = val;
        }
    } else {
        /* Write Transfer */
        val = *data;
        for (n = 31U; n; n--) {
            JTAG_CYCLE_TDI(val); /* Set D0..D30 */
            val >>= 1;
        }
        n = DAP_Data.jtag_dev.count - DAP_Data.jtag_dev.index - 1U;
        if (n) {
            JTAG_CYCLE_TDI(val); /* Set D31 */
            for (--n; n; n--) {
                JTAG_CYCLE_TCK(); /* Bypass after data */
            }
            PIN_TMS_SET();
            JTAG_CYCLE_TCK(); /* Bypass & Exit1-DR */
        } else {
            PIN_TMS_SET();
            JTAG_CYCLE_TDI(val); /* Set D31 & Exit1-DR */
        }
    }

exit:
    JTAG_CYCLE_TCK(); /* Update-DR */
    PIN_TMS_CLR();
    JTAG_CYCLE_TCK(); /* Idle */
    PIN_TDI_OUT(1U);

    /* Capture Timestamp */
    if (request & DAP_TRANSFER_TIMESTAMP) {
        DAP_Data.timestamp = TIMESTAMP_GET();
    }

    /* Idle cycles */
    n = DAP_Data.transfer.idle_cycles;
    while (n--) {
        JTAG_CYCLE_TCK(); /* Idle */
    }

    return ((uint8_t)ack);
}
#endif

/**
 * @brief 写JTAG IR寄存器
 *
 * @param ir
 */
void DAP_Port_JTAG_IR(uint32_t ir) {
    uint32_t ir_len_befor = dap_data.jtag_dev.ir_before[dap_data.jtag_dev.index];
    uint32_t ir_len_now = dap_data.jtag_dev.ir_length[dap_data.jtag_dev.index];
    uint32_t ir_len_after = dap_data.jtag_dev.ir_after[dap_data.jtag_dev.index];

    /* Run-Test/Idle -> Shift-IR **********************************************/

    SPI0_ENABLE();
    SPI0_INT_RBNE_ENABLE();             /* 抛弃接收到的数据 */
    spi_i2s_data_transmit(SPI0, B0011); /* 1,1,0,0 */
    tck_cycle_n(4);                     /* 不能多，多了就写进IR了 */
    SPI0_DISABLE();

    /* Shift-IR -> Exit1-IR ***************************************************/

    /* 前面的IR都塞满1，进入Bypass */
    while (ir_len_befor > 0) {
        uint32_t n_bit;
        if (ir_len_befor > 8) {
            n_bit = 8;
        } else {
            n_bit = ir_len_befor;
        }
        ir_len_befor -= n_bit; /* 剩余 */

        SPI0_ENABLE();
        SPI2_ENABLE();
        spi_i2s_data_transmit(SPI0, 0x00); /* 保持Shift-IR */
        spi_i2s_data_transmit(SPI2, 0xFF); /* 填充Bypass */
        tck_cycle_n(n_bit);
        SPI0_DISABLE();
        SPI2_DISABLE();
    }

    /* 写IR，最后1bit需要同时拉高TMS，进Exit1-IR */
    if (ir_len_after > 0) {
        /* 直接写IR */
        while (ir_len_now > 0) {
            uint8_t n_bit;
            if (ir_len_now > 8) {
                n_bit = 8;
            } else {
                n_bit = ir_len_now;
            }
            ir_len_now -= n_bit; /* 剩余 */

            SPI0_ENABLE();
            SPI2_ENABLE();
            spi_i2s_data_transmit(SPI0, 0x00);      /* 保持Shift-IR */
            spi_i2s_data_transmit(SPI2, ir & 0xFF); /* IR */
            tck_cycle_n(n_bit);
            SPI0_DISABLE();
            SPI2_DISABLE();
            ir = (ir >> n_bit);
        }

        /* 后面的IR都塞满1，进入Bypass，最后拉高TMS */
        while (ir_len_after > 0) {
            uint8_t n_bit;
            if (ir_len_after > 8) {
                n_bit = 8;
            } else {
                n_bit = ir_len_after;
            }
            ir_len_after -= n_bit; /* 剩余 */

            SPI0_ENABLE();
            SPI2_ENABLE();
            if (ir_len_after) {
                spi_i2s_data_transmit(SPI0, 0x00); /* 保持Shift-IR */
            } else {
                spi_i2s_data_transmit(SPI0, (1 << (n_bit - 1))); /* 最后一位拉起TMS */
            }
            spi_i2s_data_transmit(SPI2, 0xFF); /* Bypass */
            tck_cycle_n(n_bit);
            SPI0_DISABLE();
            SPI2_DISABLE();
        }
    } else {
        /* 写IR，最后1bit拉高TMS */
        while (ir_len_now > 0) {
            uint8_t n_bit;
            if (ir_len_now > 8) {
                n_bit = 8;
            } else {
                n_bit = ir_len_now;
            }
            ir_len_now -= n_bit; /* 剩余 */

            SPI0_ENABLE();
            SPI2_ENABLE();
            if (ir_len_now) {
                spi_i2s_data_transmit(SPI0, 0x00); /* 保持Shift-IR */
            } else {
                spi_i2s_data_transmit(SPI0, (1 << (n_bit - 1))); /* 最后一位拉起TMS */
            }
            spi_i2s_data_transmit(SPI2, ir & 0xFF);
            tck_cycle_n(n_bit);
            SPI0_DISABLE();
            SPI2_DISABLE();

            if (ir_len_now) {
                ir = (ir >> n_bit);
            }
        }
    }

