teledoge618/DAP_GD32F407/source/cmsis_dap/dap_port.c
    /* Exit1-IR -> Run-Test/Idle **********************************************/

    SPI0_ENABLE();
    spi_i2s_data_transmit(SPI0, B00000001); /* 1,0 */
    tck_cycle_n(8);                         /* 多发0也没关系 */
    SPI0_DISABLE();
}

/**
 * @brief JTAG读取IDCODE
 *
 * @return uint32_t
 */
uint32_t DAP_Port_JTAG_ReadIDCode(void) {
    // TODO
    return 0x12345678;
}

/**
 * @brief 终止JTAG操作
 *
 * @param data
 */
void DAP_Port_JTAG_WriteAbort(uint32_t data) {
    // TODO
}

/**
 * @brief 读取时间戳
 *
 * @return uint32_t
 */
uint32_t DAP_Port_GetTimeStamp(void) {
    /* T4 32位计数器 */
    return timer_counter_read(TIMER4);  //
}

/* 中断处理*********************************************************************/

void DMA1_Channel5_IRQHandler(void) {
    // DMA1_CH5_DISABLE(); /* 自己会关 */
    dma_flag_clear(DMA1, DMA_CH5, DMA_FLAG_FTF);
    // ULOG_DEBUG("spi tx done(dma1 ch5)\r\n");
}

void DMA1_Channel0_IRQHandler(void) {
    // DMA1_CH0_DISABLE(); /* 自己会关 */
    dma_flag_clear(DMA1, DMA_CH0, DMA_FLAG_FTF);
    // ULOG_DEBUG("spi rx dma done(dma1 ch0)\r\n");
}

void DMA0_Channel6_IRQHandler(void) {
    // dma_channel_disable(DMA0, DMA_CH6); /* 自己会关 */
    dma_flag_clear(DMA0, DMA_CH6, DMA_FLAG_FTF);
    // ULOG_DEBUG("timer3 dma done(dma0 ch6)\r\n");
}

void TIMER0_UP_TIMER9_IRQHandler(void) {
    T3_DISABLE();
    T0_UP_FLAG_CLEAR();
    // timer_interrupt_flag_clear(TIMER0, TIMER_INT_FLAG_UP);
    // timer_flag_clear(TIMER0, TIMER_FLAG_UP);
}

void SPI0_IRQHandler(void) {
    /* 自动接收数据，防止出现RXOVER影响数据接收 */
    spi_rdata_buf[0] = spi_i2s_data_receive(SPI0);
}

void SPI2_IRQHandler(void) {
    /* 自动接收数据，防止出现RXOVER影响数据接收 */
    spi_rdata_buf[0] = spi_i2s_data_receive(SPI2);
}
